Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: །དེ་ནི་བདག་གིས་རིམ་པས་ཁྱོད་ལ་བརྗོད།
en: I request you to listen, for I shall relate to you

source: །ཇི་ལྟར་བུ་མོ་འདི་སྐྱེས་བསྐྱེད་བསྐྱེད་པ། །བདག་གིས་ཁྱོད་ལ་གསོལ་གྱིས་གསན་དུ་གསོལ།
en: The way in which the birth of this girl occurred.

source: །གང་ཚེ་དགུང་སངས་ཁྱོད་ནི་བལྟམ་གྱུར་པ།
en: ‘At the end of the night when you were born,

source: །དེ་ཚེ་བདག་གི་བུ་མོ་འདི་སྐྱེས་ཏེ།
en: At that same time this daughter of mine was born.

source: །རྫུས་ཏེ་དྲི་མེད་པད་མའི་སྦུབས་ནས་བྱུང་།
en: She appeared miraculously from within a stainless lotus,

source: །ཡན་ལག་ཀུན་ཚང་མྱིག་ཡངས་འདི་ཡང་སྐྱེས།
en: Born with all her limbs complete, with lovely wide eyes.

source: །དུས་ཀྱི་ནང་ན་སོས་ཀ་དུས་མཆོག་ལ།
en: ‘During the best of seasons, the time of spring,

source: །སྨན་དང་ལོ་ཏོག་མྱུ་གུ་འཐོན་པའི་ཚེ། །སཱ་ལའི་ར་བ་བཟའ་ཤིང་རབ་མཆོག་ཏུ།
en: When herbs, harvests, and sprouts emerge, I was wandering happily

source: །བདག་ནི་རྩེ་དགའ་དེ་ཁྲོད་མཆི་མཆི་སྟེ།
en: In a perfect park of sal trees.

source: །སྣ་ཚོགས་ཡལ་གའི་ལོ་མ་རྒྱས་གྱུར་ཅིང་།
en: ‘Variegated leaves were growing on the branches.

source: །ཞུགས་ཤིང་མེ་ཏོག་སྡུག་རྒྱས་སྤྲིན་གྱི་མདོག །བྱ་བྲན་སྣ་ཚོགས་སྒྲ་སྙན་ཞུགས་ཤིང་ནང་།
en: The masses of blossoming trees were like clouds. Various birds were singing in the trees.

source: །ནགས་ཁྲོད་མྱ་ངམ་མ་མཆིས་དགར་མཆིས་མཆིས།
en: I was happy, joyful, and carefree in the forest. “ ‘I was accompanied by eight hundred girls

source: །རྒྱན་དང་ལྡན་ཞིང་ཤིན་ཏུ་ཡིད་འོང་ལ།
en: Who were adorned and very beautiful,

source: །རིན་ཆེན་རད་པ་སྣ་ཚོགས་འཚལ་པ་རྣམས།
en: Wearing all kinds of jewels

source: །རོལ་མོ་གླུ་ལ་ཤིན་ཏུ་བསླབས་པ་ཡི།
en: And trained well in music and song.

source: །བུ་མོ་བརྒྱ་ཕྲག་བརྒྱད་དང་བདག་ཀྱང་ལྡན།
en: ‘I, together with the many women, Proceeded joyfully to an area

source: །སྤོས་མཆོག་ལྡན་པའི་བུན་ད་རི་ཀ་དང་། །རྫིང་འགྲམ་མེ་ཏོག་སིལ་མས་བལྟམས་པ་ཡི། །ས་ཕྱོགས་དེ་ན་བུད་མྱེད་མང་པོ་དང་། །བདག་ཅག་དེ་ན་དགའ་བར་མཆིས་མཆིས་ན།
en: Where there were white lotuses with supreme scents And a pond with banks covered in petals.

source: །ཆབ་དབུས་དེ་ནས་རིན་ཆེན་པད་མོའི་མཆོག །འདབ་མ་སྟོང་དང་ལྡན་པ་བྱུང་བར་གྱུར།
en: ‘In the middle of the water there appeared A perfect, precious thousand-petaled lotus.

source: །ལོ་མ་རིན་ཆེན་ཡུ་བ་བཻཌཱུཪྻ།
en: Its leaves were jewels and its stem was beryl,

source: །སྙིང་པོ་འཛམ་བུ་ཆུ་ཀླུང་གསེར་ལས་བགྱིས།
en: And its pericarp was made of Jambu River gold.

source: །སྤོས་མཆོག་རིན་ཆེན་དམ་པའི་ཟེ་བ་ཅན།
en: ‘It had filaments of aromatic supreme jewels

source: །འོད་ཆེན་འཛམ་བུའི་རྒྱལ་མཚན་ཀུན་ཏུ་འཕྲོ།
en: And radiated a great light throughout Jambudhvaja.

source: །དེ་ཚེ་དགུང་ལ་གདུགས་ཤིག་ཤར་ཏམ་ཞེས། །སྐྱེ་བོ་ཀུན་ཀྱང་ཡིད་གཉིས་འཚལ་བར་གྱུར།
en: At that time, all beings were bewildered, wondering, “Has a sun arisen in the middle of the night?”

source: །དགུང་སངས་གྱུར་ནས་པད་མོ་ཆེན་པོ་དེ།
en: ‘When the night came to an end, that great lotus

source: །གདུགས་ཀྱི་འོད་ཀྱིས་རབ་ཏུ་རྒྱས་བགྱིས་ནས།
en: And the light of the great sun dawned.

source: །སྣང་བ་དེ་དང་སྒྲ་སྙན་རབ་ཀྱང་བཀྱེ།
en: Together with the light, it emitted melodious sounds.

source: །འདི་འབྱུང་དེ་ནི་སྔོན་གྱི་ལྟས་སུ་བྱུང་།
en: And these were omens of her birth.

source: །བུད་མྱེད་རིན་ཆེན་འདི་འདྲ་འཇིག་རྟེན་དུ།
en: ‘A precious girl such as this was going to appear

source: །ཚུལ་ཁྲིམས་དམ་པ་རྣམ་པར་དག་པས་བྱུང་།
en: In this world because of pure, perfect conduct.

source: །སུག་ལས་བགྱིས་པ་ཆབ་འཚལ་མི་འགྱུར་བས།
en: The karma of one’s previous actions is never lost,

source: །འདི་ནི་སྔོན་ཅད་ལེགས་པར་སྤྱད་པའི་འབྲས།
en: And this was the result of her past excellent conduct.

source: །སྐྲ་ནི་མཐོན་ཏིང་མིག་ཡངས་ཨུད་པ་ལ།
en: ‘Her hair was deep blue and her wide eyes were blue lotuses;

source: །ཚངས་པའི་དབྱངས་ལྡན་ཁ་དོག་རྣམ་དག་ལྡན།
en: She had the voice of Brahmā and a pure color.

source: །ཕྲེང་བ་རྒྱན་མཆོག་ཆ་ལུགས་དབྱིབས་སུ་ཤིས།
en: She was costumed in perfect garlands and jewelry

source: །དཔལ་ལྟར་དྲི་མྱེད་པད་མོའི་མཆོག་ལས་སྐྱེས།
en: And was born from a lotus, glorious and without stain.

source: །ལུས་ནི་རྣམ་དག་ཡན་ལག་རྒྱན་དུ་མཉམ།
en: ‘Her body was pure, all parts in proportion.

source: །ལུས་ཀྱི་དབྱིབས་ལེགས་ཡན་ལག་ཡོངས་སུ་ཚང་།
en: Her body was perfectly shaped, her limbs fully formed.

source: །གསེར་གྱི་གཟུགས་ལ་ནོར་བུས་ཕྱིས་པ་འདྲ།
en: She was like a golden statue adorned with jewels.

source: །ཕྱོགས་ཀུན་འོད་ཀྱིས་རྣམ་པར་གདའ་བར་གསལ།
en: She was shining, illuminating all directions.

source: །ལུས་ལས་ཙན་དན་རྒྱལ་པོའི་སྤོས་ཀྱི་དྲི།
en: ‘From her body came the aroma of sandalwood, the supreme perfume,

source: །ཕྱོགས་སུ་རྒྱས་པར་འདི་ཡི་ལུས་ལས་འབྱུང་།
en: Which coming from her body spread in all directions.

source: །སྒྲ་སྙན་ལྷ་རྫས་ཡིད་དུ་འོང་བརྗོད་ཚེ།
en: When she spoke, there were beautiful and divine sounds.

source: །ཁ་ནས་ཨུད་པ་ལ་ཡི་ངད་ཀྱང་ལྡང་།
en: From her mouth came the scent of the blue lotus.

source: །འདི་ནི་གང་ཚེ་འཛུམ་ཞིང་རྒོད་པའི་ཚེ།
en: ‘Whenever she smiled or whenever she laughed,

source: །རོལ་མོའི་སྒྲ་སྙན་དེ་ཚེ་འབྱུང་བར་འགྱུར།
en: There arose the melodious sound of music.

source: །བུད་མེད་རིན་ཆེན་འཇིག་རྟེན་འདིར་བྱུང་སྟེ།
en: A precious female had appeared in this world

source: །ཐ་མལ་ཀུན་གྱི་དབང་དུ་འགྱུར་མ་ལགས།
en: Who would never be under the power of anyone ordinary.

source: །ཁྱོད་མ་གཏོགས་པར་མི་ཡི་འཇིག་རྟེན་ན།
en: ‘There is no one else in this world

source: །འདི་ཡི་བདག་པོ་གཞན་ནི་གཅིག་མ་མཆིས།
en: Apart from yourself who could be her master.

source: །མཚན་རབ་བརྒྱན་པའི་སྐུ་གཟུགས་མཛེས་མངའ་བ། །ཁྱོད་ཀྱི་ཞལ་སྔར་བུ་མོ་འདི་བཞེས་གསོལ།
en: You who possess a beautiful body adorned by the signs, I pray you accept this girl who is before you.

source: །འདི་ནི་ཧ་ཅང་མི་རིང་མི་ཐུང་སྟེ།
en: ‘She is not too tall and not too short.

source: །ཧ་ཅང་མི་སྦོམ་ཧ་ཅང་ཕྲ་མ་ལགས།
en: She is not too plump and not too thin.

source: །ལྟོ་ནི་གཞུ་འདྲ་ནུ་མ་ཤས་ཀྱང་རྒྱས།
en: Her waist is like a bow, and her breasts are large.

source: །ཡན་ལག་སྐྱོན་བྲལ་འདི་ནི་ཁྱོད་ལ་འོས།
en: Her limbs are faultless, and she is worthy of you.

source: །གྲངས་དང་ཡི་གེ་ཤེས་བགྱི་ཚུལ་རྣམས་དང་། །ལག་བརྡའི་ཚུལ་དང་གཙུག་ལག་ཚུལ་ལ་མཁས།
en: ‘She is skilled in hand gestures and treatises And likewise in the ways of counting and writing. She has perfected, without exception,

source: །འཇིག་རྟེན་ཀུན་ན་བཟོ་རྣམས་ཇི་སྙེད་པ། །མ་ལུས་དེ་ལ་འདི་ནི་ཕ་རོལ་ཕྱིན།
en: All the arts there are in the world.

source: །མདའ་གཞུའི་ཚུལ་ལ་འང་རྣམ་པ་རྒྱུས་སུ་མཁས།
en: ‘She has complete knowledge of bows and arrows,

source: །འཕོང་གི་ཆོ་ག་རྣམ་པར་ངེས་པར་རྟོགས།
en: And she has definitively mastered the art of archery. She has attained supreme perfection in the ways

source: །དགྲ་ཡིད་བཞོང་ཞིང་དབབ་པ་ཀུན་ལ་ཡང་། །འདི་ནི་མཆོག་ཏུ་ཕ་རོལ་ཕྱིན་པར་གྱུར།
en: Of attracting enemies and calming their minds.

source: །ལུས་རྣམས་ཀུན་ལ་རིན་ཆེན་རྣམ་དག་པའི།
en: ‘Her entire body is perfectly adorned

source: །འོད་མཆོག་འཁོར་གྱིས་ཤིན་ཏུ་མཛེས་པ་སྟེ།
en: By a halo of a pure jewel’s supreme light.

source: །སྔོན་བགྱིས་ལེགས་པས་ཤིན་ཏུ་སྡུག་པར་བརྒྱན།
en: She is beautifully adorned through her past good actions.

source: །འདི་ནི་ཁྱོད་ཀྱི་ཕྱག་རྗེད་ཁྱོད་ལ་འོས།
en: She is worthy to be at your service. “ ‘She knows through the art of medicine how to heal

source: །མི་ཡི་འཇིག་རྟེན་གནས་རྣམས་ཇི་སྙེད་པ། །དེ་དག་གསོ་བའི་ཚུལ་གྱི་ཆོ་ག་འཚལ།
en: All the illnesses in the human world.

source: །དེ་དག་མ་ལུས་ཐམས་ཅད་ཞིར་བགྱི་ནའང་།
en: She eliminates them without exception

source: །མ་ནོར་སྨན་གྱི་ཆོ་གས་གསོ་ལ་མཁས།
en: Through the correct practice of medicine. “ ‘She has also attained perfection in the various

source: །འཛམ་བུའི་རྒྱལ་མཚན་སྐད་རྣམས་ཐམས་ཅད་དང་། །སྐྱེ་བོའི་ངེས་ཚིག་མ་ལུས་བྱེ་བྲག་དང་། །འཇིག་རྟེན་ཐ་སྙད་བརྗོད་པའི་མཚམས་སྦྱར་བ།
en: Languages throughout Jambudhvaja, Every specific definition of beings without exception, And the application of terminologies in the world.

source: །སྣ་ཚོགས་ཀུན་ལའང་འདི་ནི་ཕ་རོལ་ཕྱིན།
en: ‘She has comprehended the ways of the categories

source: །དབྱངས་ཀྱི་ཡན་ལག་མངོན་པར་བསྒྲུབ་པའི་ཚུལ། །དེ་དག་བྱེ་བྲག་ཚུལ་ལའང་རབ་ཏུ་ཞུགས།
en: Of accomplishing the different aspects of the voice.

source: །འཇིག་རྟེན་གླུ་གར་རྣམ་པ་ཇི་སྙེད་པ།
en: She knows the ways of all singing and dancing

source: །མ་ལུས་དེ་རྣམས་ཀུན་གྱི་ཚུལ་ཡང་འཚལ།
en: Without exception that are to be found in this world.

source: །རོལ་མོ་སིལ་སྙན་དག་གི་ཐབས་རྣམས་དང་། །བཞད་གད་རོལ་མོའི་ཚུལ་ལ་རྣམ་པར་མཁས།
en: ‘She comprehends the methods of drumming and music And of comedic and dramatic performances.

source: །ཆགས་དང་མ་ཆགས་མི་རྣམས་མངོན་འཚལ་ཀྱང་།
en: Though she knows men who are passionate and those who are not,

source: །ཁོང་ཁྲོ་ཆགས་པར་འགྱུར་བ་མ་མཆིས་སོ།
en: She herself has neither desire nor anger toward them. “ ‘She knows without exception all the different

source: འཇིག་རྟེན་བུད་མེད་སྒྲ་རྣམས་ཇི་སྙེད་པ།
en: Uses of the voice by women in the world.

source: །ཁྱད་པར་ནང་དུ་དེ་ལ་མ་ལུས་འཚལ།
en: She does not have even a single one

source: །བུད་མྱེད་སྐྱེ་བོའི་སྐྱོན་དུ་བགྱི་བ་རྣམས། །གྲངས་མེད་དེ་དག་འདི་ལ་གཅིག་མ་མཆིས།
en: Of the countless faults of women. “ ‘She has fully mastered the skill in all the arts

source: །ཐིལ་གྱིས་བལྟ་དང་ཟུར་གྱིས་བལྟ་བ་དང་། །ཡན་ལག་སྟབས་དང་ཡན་ལག་རྣམས་བསྟན་དང་། །ཤེས་ཉེན་ཀུན་ལ་མཁས་པའི་མཐར་ཕྱིན་ཏེ།
en: Of the direct gaze, the sideways gaze, Giving her body, and revealing her body.

source: །ཁྱོད་ཀྱི་དགོངས་པ་ཡོངས་སུ་རྫོགས་པར་བགྱིད།
en: She will completely fulfill your heart’s desires.

source: །འདི་ནི་ཕྲག་དོག་སེར་སྣ་མ་མཆིས་ཏེ།
en: ‘She is not jealous; she is not greedy.

source: །འདོད་པ་ཞེ་དུག་མི་ལྡང་སྡིག་མི་བགྱིད།
en: She does not indulge in desires or commit bad actions.

source: །བཟོད་ཅིང་དྲང་ལ་མཉེན་ཞིང་དེས་པ་སྟེ།
en: She is patient, honest, gentle, and tender.

source: །མི་ཁྲོ་མི་བརླང་ཤིན་ཏུ་མཁས་པ་ལགས།
en: She is not angry, she is not harsh, and she is very wise. “ ‘She is ever ready and speaks agreeably.

source: །ལྡང་བའི་ངང་ཚུལ་ཡིད་དུ་འོང་བའི་ངག །རྟག་ཏུ་བླ་མའི་ཐུགས་དང་སྦྱོར་བ་སྟེ།
en: She is always obedient to her gurus.

source: །སྐུ་ཉམས་གར་བདེ་ལྟ་ཞིང་སྲིད་ཞུ་ཆེ།
en: Her behavior is always pleasant and very respectful.

source: །ཁྱོད་ཀྱི་སྤྱོད་མཐུན་རྗེས་སྙེགས་ཚུལ་དང་མཐུན།
en: She will appropriately be in harmony with your conduct. “ ‘She always has compassion for those

source: །རྒས་ཤིང་གཏུགས་དང་ནད་དང་ལྡན་པ་དང་། །ཕོངས་པ་ཤིན་ཏུ་སྡུག་བསྔལ་གྱུར་པ་དང་། །མིག་དང་བྲལ་ཞིང་མགོན་སྐྱབས་མ་མཆིས་ལ། །འདི་ནི་སྙིང་བརྩེ་རྟག་ཏུ་བསྐྱེད་པ་ལགས།
en: Who have become aged and who are ill, Who are destitute and who are suffering, Who are blind and have no one to care for them.

source: །འདི་ནི་རྟག་ཏུ་གཞན་དོན་སེམས་ལ་བརྩོན།
en: ‘Her mind is always dedicated to benefiting others.

source: །བདག་ལ་སྨན་པ་སེམས་པར་བགྱིད་མ་མཆིས།
en: She never thinks of benefits for herself.

source: །འཇིག་རྟེན་ཀུན་ལ་སྨན་པར་དགའ་བ་སྟེ།
en: She rejoices in benefiting the entire world.

source: །རླབས་ཆེན་སེམས་ཀྱི་ཡོན་ཏན་ཀུན་གྱིས་བརྒྱན།
en: She is adorned with vast qualities of the mind. “ ‘She is always attentive, mindful, and circumspect,

source: །མཆིས་སམ་ཉལ་ལ་མ་མཆིའམ་འགྲེང་ཡང་རུང་།
en: Whether standing, sitting, lying down, or walking,

source: །སྨྲའམ་མི་སྨྲ་འཛུམ་ཞིང་རྒོད་ཀྱང་རུང་། །རྟག་ཏུ་བག་མཆིས་དྲན་པ་ཤེས་བཞིན་ཏེ།
en: Whether speaking or silent, smiling or laughing,

source: །འདི་ནི་འཇིག་རྟེན་ཀུན་གྱིས་རྟག་ཏུ་བསྔགས།
en: And she is always praised by the whole world.

source: །བསོད་ནམས་ལྡན་པས་ཀུན་ཏུ་རྣམ་པར་སྣང་།
en: ‘She always appears to be meritorious,

source: །འགྲོ་བ་ཀུན་ཀྱང་རྟག་ཏུ་དགའ་བ་སྟེ།
en: She is always beloved by all people,

source: །འདི་ལ་ལྟ་བས་འཇིག་རྟེན་ངོམས་མྱི་འགྱུར།
en: Who never have enough of gazing upon her,

source: །འདི་ནི་གང་ལའང་ཆགས་པར་མ་མཆིས་ལགས།
en: And she has no attachment to anything in the world.

source: །དགེ་བཤེས་རྣམས་ལ་སྲི་ཞུ་འདི་ཆེ་སྟེ།
en: ‘She is respectful to kalyāṇamitras,

source: །དེ་དག་མཐོང་བར་རྟག་པར་རབ་ཏུ་དགའ།
en: And she is always happy to see them.

source: །རྗེས་སུ་ཅི་འབྱུང་ལྟ་ཞིང་སྐྱོན་མེད་ཚུལ།
en: She looks far ahead, and her intentions are faultless.

source: །སེམས་བདག་བརྟན་པ་རི་རབ་རི་དང་འདྲ།
en: Her pure mind is as stable as Sumeru

source: །འདི་ནི་བསོད་ནམས་མཆོག་གིས་རྟག་ཏུ་བརྒྱན།
en: ‘She is always adorned by her excellent merit.

source: །མི་མཛའ་དགྲར་ལེན་འདི་ལ་ཡོད་མ་མཆིས།
en: She does not see anyone as being her enemy.

source: །འདིའི་ཤེས་འདྲ་བུད་མྱེད་གཅིག་མ་མཆིས།
en: There is no woman who has her kind of wisdom.

source: །རྒྱལ་སྲས་ཁྱོད་ལ་འདི་ནི་ཚུལ་དང་འཐུན།། །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Prince, she would be a suitable match for you.’

source: །བམ་པོ་བཅོ་ལྔ་བ། དེ་ནས་རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་བཟའ་ཤིང་གི་ར་བ་སྤོས་ཀྱི་མྱུ་གུའི་རྩེ་མོ་ལས་འོད་ཀྱི་སྤྲིན་འབྱུང་བར་ཕྱིན་ཏེ། །བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པའི་མ་སྤྲུལ་འཚོང་མའི་གཙོ་མོ་བལྟ་ན་སྡུག་པའི་མདུན་དུ། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་ང་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཞུགས་པ་ཡིན་ཏེ།
en: “Then Prince Tejodhipati came to Gandhāṅkura­prabha­megha, and, in the presence of Sudarśanā, the preeminent courtesan, who was the mother of Sucalita­rati­prabhāsa­śrī, he said to Sucalita­rati­prabhāsa­śrī, ‘Girl, I have undertaken to attain the highest, complete enlightenment.

source: དེ་བས་ན་ངས་ཐམས་ཅད་མཁྱེན་པའི་ཚོགས་ནི་ཚད་མྱེད་པ་ཞིག་བསྩགས་པར་བྱ་དགོས་བསྐལ་པ་མཐའ་དང་དབུས་མེད་པ་ཞིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་སྦྱད་པ་སྤྱོད་དེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ནི་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས།
en: Therefore, I have to gather an immeasurable accumulation of omniscience. Throughout kalpas with no end or middle I must practice bodhisattva conduct and complete all the perfections.

source: ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་མཆོད་པར་བྱ་དགོས་ཏེ།
en: I must make offerings to the tathāgatas until the very last of future kalpas.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བསྟན་པ་ནི་ཡོངས་སུ་གཟུང་བར་བྱ།
en: I shall obtain the teachings of all the buddhas.

source: སངས་རྒྱས་ཀྱི་ཞིག་ཐམས་ཅད་ནི་ཡོངས་སུ་སྦྱང་པར་བྱ།
en: I shall purify all buddha realms.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ནི་མི་གཅད་པར་བྱ།
en: I shall not be separated from the families of all tathāgatas.

source: སེམས་ཅན་གྱི་རྒྱུད་ཐམས་ཅད་ནི་ཡོངས་སུ་སྨྱིན་པར་བྱ།
en: I shall ripen all the families of beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་འཁོར་བའི་སྡུག་བསྔལ་ནི་རྣམ་པར་བཟློག་པར་བྱ།
en: I shall dispel the suffering of saṃsāra for all beings.

source: མཐའ་ལས་རྒལ་བར་བདེ་བ་ལ་ནི་སེམས་ཅན་རབ་ཏུ་དགོད་པར་བྱ།
en: I shall bring beings to a bliss that is beyond all limits.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་མྱིག་ནི་ཡོངས་སུ་དག་པར་བྱ།
en: I shall purify the eyes of wisdom of all beings.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བསྒྲུབ་པ་ལ་ནི་བརྩོན་པར་བྱ།
en: I shall be dedicated to the accomplishments of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ལ་ནི་གནས་པར་བྱ།
en: I shall rest in the equanimity of all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ས་ནི་ཡོངས་སུ་བསྒྲུབ་པར་བྱ།
en: I shall accomplish the bhūmis of all bodhisattvas.

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ནི་ཡོངས་སུ་སྦྱང་བར་བྱ།
en: I shall purify the realms of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཕོངས་པ་ཡོངས་སུ་གཙང་པའི་ཕྱིར་བདག་གི་ནོར་ཐམས་ཅད་ནི་གཏང་བར་བྱ།
en: I shall give away all my wealth so as to eliminate the poverty of all beings.

source: ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་ལ་སྤྱོད་པའི་ཚེ། ཁ་ཟས་དང་། བཏུང་བའི་སྦྱིན་པས་ནི་སེམས་ཅན་ཡོངས་སུ་ཚིམ་པར་བྱ། ཡོ་བྱད་ཀྱི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བས་ནི་སློང་བའི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱ་དགོས་ཏེ། དེ་ལྟར་ང་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་པ་ལ་ནན་ཏན་ཉམས་སུ་ལེན་པའི་ཚེ།
en: ‘While I am practicing the perfection of generosity until the last future kalpa, I shall satisfy beings with the gift of food and drink, and through the gift of all kinds of artifacts I must bring satisfaction to all assemblies of supplicants.

source: ཕྱི་ནང་གི་དངོས་པོ་གང་ཅི་རུང་སྟེ།
en: ‘While I am in that way practicing the dedication to giving away everything, there will be nothing internal or external that I will not give away.

source: ཡོངས་སུ་མི་གཏང་བ་དེ་ལྟ་བུ་མེད་པས་དེ་ལྟར་ངས་བུ་དང་བུ་མོ་དང་། ཆུང་མ་ཡང་སྦྱིན་པར་བྱ་དགོས།
en: Therefore, I will have to give away even my sons, daughters, and wives.

source: མྱིག་དང་མགོ་དང་རྐ་ལག་དང་། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་གཏང་དགོས་ན།
en: I will have to give away my eyes, head, legs, arms, and the greater and smaller parts of my body.

source: །དེའི་ཚེ་ཁྱོད་གཞན་བྱིན་ན། ངའི་སྦྱིན་པའི་བགེགས་སུ་འགྱུར་རོ།
en: ‘At that time, you would become an obstacle to my generosity of giving to others.

source: །བུ་ཡིད་དུ་འོང་བ་ཡོངས་སུ་གཏང་ན་ཡིད་མི་དགའ་བར་འགྱུར་རོ།
en: You would become unhappy when I give away our beautiful sons.

source: །ལུས་དང་སེམས་ཀྱི་སྡུག་བསྒལ་ཡང་མང་པོ་ཞིག་ཉམས་སུ་མྱོང་བར་འགྱུར་རོ།
en: You would experience much physical and mental suffering.

source: །ང་ལ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བར་བྱས་ན་སེར་སྣའི་སེམས་སུ་འགྱུར་རོ།
en: When I give away everything, you would become miserly.

source: །ངའི་ཡན་ལག་དང་ཉིང་ལག་གཏུབས་ཤིང་སློངས་མོ་པ་རྣམས་ལ་གཏོང་བའི་ཚེ།
en: When I cut off the greater and smaller parts of my body and give them to supplicants, you would become unhappy.

source: ཡིད་མི་དགའ་བར་ཡང་འགྱུར་རོ། །ནམ་ཞིག་ན་ངས་ཁྱོད་བོར་ཏེ་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་དུས་ཀྱང་ཡོད་དེ།
en: There will also come a time when I would abandon you and enter homelessness within the teaching of a tathāgata.

source: དེའི་ཚེའང་ཁྱོད་ཡིད་མི་དགའ་བར་འགྱུར་རོ། །ཞེས་ནས་རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་བོས་དེའི་ཚེ།
en: At that time you would become unhappy.’

source: བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then, at that time, Prince Tejodhipati recited these verses to the girl Sucalita­rati­prabhāsa­śrī:

source: །ངས་ནི་འགྲོ་ཀུན་སྙིང་རྗེ་རབ་བསྐྱེད་དེ།
en: ‘I have developed compassion for all beings.

source: །ཡུན་རིང་མཆོག་ནས་བྱང་ཆུབ་རབ་ཞུགས་པས།
en: For a long time I have been set on enlightenment.

source: །ཡང་དག་བྱང་ཆུབ་ཚོགས་ཆེན་རྒྱ་མཚོ་རྣམས། །ཚད་མེད་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་བྱ་དགོས།
en: I must complete all the limitless oceans Of the great accumulations for true enlightenment.

source: །བསྐལ་པ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མྱེད་པར།
en: ‘For an ocean of kalpas that has no edge or middle,

source: །མཁའ་ལྟར་ཚད་མྱེད་སྨོན་ལམ་རྣམ་སྦྱངས་ཤིང་། །དེ་བཞིན་གཤེགས་པ་བཞུགས་པའི་ས་ཡི་རྣམས།
en: As measureless as space, I have purified my prayers.

source: །བསྐལ་པ་མཐའ་ཡས་ཡོངས་སུ་སྦྱངས་ཡང་དགོས།
en: I must completely purify throughout endless kalpas The bhūmis on which the tathāgatas reside. “ ‘I will train in the path of the perfections

source: །རྒྱལ་བ་དུས་གསུམ་འབྱུང་བ་ཐམས་ཅད་ཀྱི།
en: Of all the jinas who appear in the three times.

source: །ཕ་རོལ་ཕྱིན་པའི་ལམ་ལ་ངས་བསླབས་ཏེ།
en: I must purify the supreme path to enlightenment

source: །ཡེ་ཤེས་བླ་ན་མེད་པའི་ཚུལ་ཆེན་གྱིས། །བྱང་ཆུབ་ལམ་མཆོག་རྣམ་པར་སྦྱངས་ཡང་དགོས།
en: Through the great way of the highest wisdom. “ ‘I will completely purify of defilements

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་ཞིང་རྣམས་ཐམས་ཅད་ཀྱང་། །ཀུན་ནས་ཉོན་མོངས་རྣམ་པར་སྦྱང་བར་བྱ།
en: All the realms that are in every direction.

source: །འཇིག་རྟེན་ཀུན་གྱི་མི་ཁོམ་ཐམས་ཅད་དང་། །ངན་སོང་ཀུན་ཀྱང་རྣམ་པར་བཟློག་དགོས་སོ།
en: I must dispel all unfortunate states in worlds And even all the lower existences. “ ‘I must purify every being, without exception,

source: །ཉོན་མོངས་བསྒྲིབས་ཤིང་གཏི་མུག་མུན་འཐོམས་པའི། །སེམས་ཅན་ཀུན་ཀྱང་མ་ལུས་རྣམ་སྦྱང་དགོས།
en: Enveloped in the darkness of ignorance and obscured by kleśas.

source: །སྣ་ཚོགས་ཐབས་ཀྱིས་ཡོངས་སུ་སྦྱང་བྱས་ཏེ།
en: I must purify them through various methods

source: །ཐམས་ཅད་མཁྱེན་ལ་ཚུལ་ལ་དགོད་ཀྱང་དགོས།
en: And bring them into the way of the path to omniscience.

source: །ཆགས་མེད་ས་རྣམས་ཀུན་ཀྱང་ངས་སྦྱངས་ཏེ།
en: ‘I shall purify all the levels of nonattachment

source: །བསྐལ་པ་རྒྱ་མཚོར་རྒྱལ་བ་མཆོད་པར་བྱ།
en: And make offerings to the jinas for an ocean of kalpas.

source: །འགྲོ་བ་མ་ལུས་ཀུན་ལ་བྱམས་བསྐྱེད་དེ།
en: I had developed love for all beings without exception,

source: །འཇིག་རྟེན་དག་ཏུ་མ་ལུས་སྦྱིན་གཏང་དགོས།
en: And I must give away everything in the world.

source: །སློང་བ་ཀུན་ནས་འདུས་ཤིང་འོངས་མཐོང་ནས།
en: ‘When I see supplicants gathering and coming,

source: །ཐམས་ཅད་གཏང་བར་རྟག་ཏུ་བརྩོན་གྱུར་ན།
en: I will dedicate myself to giving away everything.

source: །དེ་ཚེ་ཁྱོད་ནི་ང་སེམས་མི་འཐུན་ཏེ།
en: At that time won’t you be in disagreement with me

source: །ཞུམ་ཞིང་དམའ་ལ་འཇུངས་པར་མི་འགྱུར་རམ།
en: And become saddened and be downcast?

source: །ངའི་མགོ་འདོད་འོངས་པ་ངས་མཐོང་སྟེ།
en: ‘When I see someone come who wants my head,

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་གྱུར་ན།
en: And if I then practice bodhisattva conduct,

source: །དེ་ཚེ་ཁྱོད་ནི་སྡུག་བསྔལ་བ་གདུངས་གྱུར་གྱིས།
en: You will at that time be tormented by suffering.

source: །འདི་འདྲའི་དོན་ཐོས་རབ་ཏུ་བསྟན་པར་གྱིས།
en: Listen to what I tell you and be resolute.

source: །ངའི་རྐ་ལག་གཏུབས་པ་མཐོང་གྱུར་ན།
en: ‘When you see my legs and arms cut off,

source: །ཁྱོད་ནི་མི་དགའ་དེ་ཚེ་སློང་བ་ལ།
en: At that time you will be distressed.

source: །བུད་མྱེད་ངང་གིས་ཚིག་དྲག་མི་བཟོད་སྨྲ།
en: And you the woman will hear dreadful, harsh things.

source: །དོན་འདི་ཐོསཤིང་སེམས་ལ་ཡོངས་སུ་སོམས།
en: Listen to what I say and consider it. “ ‘I will have to give away the highest material things, and similarly

source: །འཕགས་པའི་དངོས་དག་དེ་བཞིན་བུ་རྣམས་དང་། །ཁྱོད་ཀྱང་སློང་བའི་ཚོགས་ལ་སྦྱིན་དགོས་ཀྱིས།
en: My children and even you, to the crowds of supplicants.

source: །དོན་འདི་ཐོས་ཏེ་མི་དགའ་མྱེད་ན་ལྟ།
en: On hearing this, see if it does not sadden you.

source: །ཁྱོད་དགའ་ཐམས་ཅད་དེ་བཞིན་བྱ་ལ་རག།
en: All that you wish for depends on that.’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས། རྒྱལ་བུ་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །གཞོན་ནུ་ཇི་སྐད་གསུངས་པ་དེ་ལྟར་བགྱིའོ།
en: “Then the girl Sucalita­rati­prabhāsa­śrī said to Prince Tejodhipati, ‘Prince, may it be just as you have said, and I will do whatever you want.

source: །བདག་ནི་ཁྱོད་ཅི་དགྱེས་པ་དང་། །ཅི་བཞེད་པར་ལོངས་སྤྱོད་པ་དང་། གང་དུ་དགྱེས་པར་མཆི་བ་དང་། ཐམས་ཅད་དུ་ཡང་སླད་ནམ་ལས་པར་རྗེས་སུ་འབྲང་བ་དང་། རྟག་ཏུ་ཞམ་རིང་སླེབས་པ་དང་། དོན་ཐམས་ཅད་ལ་བརྩོན་པ་དང་། ཐུགས་དང་འཐུན་པར་སྤྱད་པ་དང་། མེད་པར་ཉམས་སུ་བླང་བ་དང་། །མི་འཐུན་པ་མ་མཆིས་བར་ནན་ཏན་ཏུ་བགྱི་བའི་ཚུལ་ལ་སྤྱད་པར་བགྱིའོ། །ཞེས་ནས་བུ་མོ་དགའ་བའི་འོད་ཀྱི་དཔལ་ཤིན་ཏུ་སྦྱངས་པས།
en: I will enjoy whatever you wish. Wherever you wish to go, I will follow you everywhere. I will always be in your presence, I will be dedicated to your goals, I will act in harmony with you, and I will practice sincerely; my conduct will be engaged in practicing that which accords with you.’

source: རྒྱལ་པོའི་སྲས་གཟི་བརྗིད་ཀྱི་བདག་པོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then the girl Sucalita­rati­prabhāsa­śrī recited these verses to Prince Tejodhipati:

source: བདག་གི་ལས་འདི་སེམས་ཅན་དམྱལ་བ་ཡི། །ཞུགས་ཀྱིས་ཡོངས་སུ་གདུངས་ཞུ་བར་གྱུར་ཀྱང་རུང་།
en: ‘Even though my body is destroyed By being incinerated in the fires of hell,

source: །ཁྱོད་སྤྱོད་སྐལ་བ་མཉམ་པའི་ཕྱག་རྗེད་དུ།
en: I will have the fortitude to assist you

source: །ཚེ་རབས་རྒྱ་མཚོར་བདག་གི་སྤྲོ་བར་བགྱི།
en: In our common practice during an ocean of lifetimes. “ ‘Even though my body is chopped up

source: །ཚེ་རབས་མཐའ་ཡས་སྐྱེས་པ་རེ་རེ་ཞིང་། །བདག་གི་ལས་ནི་ཤིན་ཏུ་གཏུབས་གཤགས་ཀྱང་།
en: In each rebirth in endless lifetimes,

source: །བརྟན་དམ་སེམས་ཀྱིས་རབ་ཏུ་སྤྲོ་བར་བགྱིས།
en: I will be resolute in my fortitude

source: །དད་དགེ་ཁྱོད་ཀྱིས་བདག་གི་ཁྱིམ་ཐབ་མཛོད། །ཁོར་ཡུག་རི་ཡིས་བསྐལ་པ་མཐའ་ཡས་སུ།
en: To have you, virtuous one, as my husband.

source: བདག་གི་མགོ་ནི་ཡོངས་སུ་བཏགས་གྱུར་ཀྱང་།
en: ‘Even though, for endless kalpas, my head Is crushed by the Cakravāla mountains,

source: །སེམས་ལ་མི་བདེ་མ་མཆིས་དད་པར་བགྱིད།
en: I would not be unhappy but would have faith in you,

source: །ཁྱོད་ཀྱིས་རྟག་པར་བདག་གི་ཁྱིམ་ཐབ་མཛོད།
en: And you would always be my spouse.

source: །ཁྱོད་ཀྱིས་ཚེ་རབས་གྲངས་མེད་ཐམས་ཅད་དུ།
en: ‘Within all our countless lifetimes,

source: །བདག་ལ་ཐུགས་བརྟན་ཐུགས་ཀྱིས་མངའ་མཛད་དེ།
en: Give me mental stability and control over my own mind,

source: །ལན་ལག་ཤ་གཏུབས་གཞན་ལ་སྩལ་བར་མཛོད།
en: And cut off my limbs and give them to others:

source: །ཁྱོད་ཀྱི་ཆོས་ལ་བདག་ཀྱང་བརྟན་གཞག་གསོལ།
en: I pray that you establish me firmly in your Dharma.

source: །བདག་གི་ལས་ནི་སླད་ན་མ་ལས་པར།
en: ‘All my successive bodies, without exception,
